[
    {
        "id": "71c4d42a-f013-4cdf-9fda-42f6dc66b9a4",
        "name": "Calculator",
        "description": "This is a calculator built using react. It supports all of the basic operations of addition, multiplication, subtraction and division. It also allows users to alternate between color themes to suit their individual preferences.",
        "src": "project-calculator-app.png",
        "alt": "An image showing the initial state of the calculator application in its default state",
        "repoURL": "https://github.com/joeehis1/Calculator-Application",
        "isFeatured": false,
        "liveSiteURL": "https://simpulcalk.netlify.app/"
    },
    {
        "id": "6da12013-a680-4267-8c72-8a680ff106aa",
        "name": "Password Generator",
        "description": "This is a password generator built using html, css and vanilla javascript. A typical user has the ability to select their desired password length and the type of characters to use in their password. Once the password has being created they are able to click on an icon to copy generated password",
        "src": "project-password-gen.png",
        "alt": "An image Showing the active state of the password generator project",
        "isFeatured": false,
        "repoURL": "https://github.com/joeehis1/password-generator",
        "liveSiteURL": "https://github.com/joeehis1/password-generator"
    },
    {
        "id": "80589cff-e50d-4d01-a51b-dce5b48e9f10",
        "name": "Quiz Application",
        "description": "This is a quiz application built using react. The data for the quiz is obtained from the open trivia database. A typical user is able to select their desired difficulty level and the category of questions that they'd like to answer. After completing the quiz which consists of five questions, they're able to see their scores and they have the option to reset the quiz and pick another category of questions.",
        "alt": "An Image showing the introductory section of a quiz application",
        "src": "project-quiz-application.png",
        "isFeatured": false,
        "repoURL": "https://github.com/joeehis1/Quizzical",
        "liveSiteURL": "https://relaxed-starburst-7ce14d.netlify.app/"
    },
    {
        "id": "55c9b9aa-36d2-4fdb-9f19-8ddac5768929",
        "name": "Unit Converter",
        "description": "This is unit converter built using html, css and javascript. A typical user would be able to get a unit conversion for mass, length and volume in both metric and imperial units by entering a number into the input field.",
        "alt": "An image showing the active state of a unit converter application",
        "src": "project-unit-converter.png",
        "repoURL": "https://github.com/joeehis1/unit_converter",
        "isFeatured": false,
        "liveSiteURL": "https://heroic-profiterole-f951b8.netlify.app/"
    },
    {
        "id": "184250e1-7d96-447b-a9dc-19b20596133b",
        "name": "Tenzies Game",
        "description": "This is a minimal app build of the tenzies game. In this build, a player would typically attempt to get the same number showing on every dice roll. Each \"roll\" of the dice generates a random number on each die face. As soon as every die face is the same, the timer stops running. Each time a user resets the game, the timer starts back up and the user's times for each game session is displayed on a table that can be displayed or hidden.",
        "alt": "An image showing the initial state of the tenzies game",
        "src": "project-tenzies.png",
        "repoURL": "https://github.com/joeehis1/tenzies-project",
        "isFeatured": false,
        "liveSiteURL": "https://quiet-sopapillas-e4cbaf.netlify.app/"
    },
    {
        "id": "b9440077-a341-46c8-8c4d-4c3c04162ea5",
        "name": "Movie watchlist",
        "description": "The watchlist application was built using html, css and vanilla javascript. A typical user would search for a movie they intended on watching. The input string would be used in making a call to the open movie database API to retrieve all movies related to that particular search string. Each result can be saved and viewed later since all searches are saved to local storage",
        "alt": "An image showing the initial state of the movie watchlist project",
        "src": "project-watchlist-app.png",
        "repoURL": "https://github.com/joeehis1/movie-watchlist",
        "isFeatured": false,
        "liveSiteURL": "https://incomparable-sable-5ad6b9.netlify.app/"
    },
    {
        "id": "c60e9b78-a19e-4573-930d-8059ec75ab14",
        "name": "Markdown Editor",
        "description": "This is a markdown editor that has a dark and light mode functionality built using react. I used redux for state management. All documents and previously selected items are saved to local storage so a user will be able to continue from where they were prior to closing the application.",
        "alt": "This is an image showing the initial state of the markdown editor project",
        "isFeatured": false,
        "src": "project-markdown-editor.png",
        "repoURL": "https://github.com/joeehis1/markdown-editor",
        "liveSiteURL": "https://venerable-belekoy-9692bc.netlify.app/"
    },
    {
        "id": "d95788c8-bd9a-46f8-9477-4d32674cc62b",
        "name": "Task Manager",
        "description": "This is a task manager built using HTML, CSS, javascript, jquery and bootstrap. It features a drag and drop functionality for moving added tasks from one pane to the other and a color coding system to indicate how far away from a due date an included task is.",
        "alt": "This is an image showing the initial state of the task manager project",
        "isFeatured": false,
        "src": "project-task-manager.png",
        "repoURL": "https://github.com/joeehis1/task-manager-app",
        "liveSiteURL": "https://joeehis1.github.io/task-manager-app/"
    },
    {
        "id": "981bcd70-f44c-4c1d-84a2-4035ca87b484",
        "name": "Coding quiz",
        "description": "This is a coding trivia application built using HTML, CSS and Javascript. It gives users multiple choice questions within a given time frame and scores them based on correct answers provided and penalises wrong answers by deducting time from the quiz duration",
        "alt": "This is an image showing the initial state of the coding quiz project",
        "isFeatured": false,
        "src": "project-coding-quiz.png",
        "repoURL": "https://github.com/joeehis1/coding-quiz",
        "liveSiteURL": "https://joeehis1.github.io/coding-quiz/"
    },
    {
        "id": "5fdaa7f3-c6d3-4729-8d60-11a24ab493ca",
        "name": "Chakula App",
        "description": "A full stack application built using node, express and mongodb. It provides a sleek interface that allows an authenticated user to generate a recipe based on a users fitness goals and caloric requirments. It also allows users to search prices of grocery items from websites of popular grocery stores. This application is still under active development.",
        "isFeatured": true,
        "alt": "An image showing the welcome page of the chakula app",
        "src": "project-chakula-app.png",
        "repoURL": "https://github.com/chakula-accelerator7/chakula-app",
        "liveSiteURL": "https://chakula-app.onrender.com/landing"
    },
    {
        "id": "596360ed-c0b4-4a32-80ed-3709652a7086",
        "name": "Countdown Timer",
        "description": "A single page application built with react and typescript. It works as a traditional pomodoro timer while giving users the ability to modify the duration of a work interval, a short break interval and the long break interval. It also allows users to change the colors in use by the application.",
        "isFeatured": false,
        "alt": "An image showing the initial state of the pomodoro countdown timer application",
        "src": "project-pomodoro-app.png",
        "repoURL": "https://github.com/joeehis1/pomodoro-app",
        "liveSiteURL": "https://pomo-interval.netlify.app/"
    }
]
